Add infromation in readme
